content/posts/how_to_annotate_literally_everything.md
+++
title = "How to Annotate Literally Everything"
author = ["Daniel Biasiotto"]
date = 2021-12-24T23:27:00+01:00
tags = ["article"]
draft = false
+++

-   Source: <https://beepb00p.xyz/annotating.html>
-   Author: [beepb00p]({{< relref "beepb00p.md" >}})
-   Related: [Note Taking]({{< relref "20200528214634-note_taking.md" >}})


## Outline {#outline}


### Web {#web}

-   Pocket
    -   no notes or highlighting
-   Instapaper
    -   highlighting only inside its app
    -   useful on mobile as the app has offline capabilities
-   Wallabag
-   [Hypothes.is]({{< relref "hypothes_is.md" >}})
    -   use of JS for a in-browser overlay
    -   fuzzy anchoring
    -   public annotation - [Learn In Public]({{< relref "learn_in_public.md" >}})
    -   python [wrapper](https://github.com/judell/Hypothesis) for the API
    -   can use bookmarklet on mobile browser


### PDF {#pdf}

-   Atril
-   Evince
-   Okular
-   [Emacs]({{< relref "20200530210833-emacs.md" >}})
    -   pdf-tools
    -   org-noter
-   Zathura[^fn:1]
-   Xournal
-   [Hypothes.is]({{< relref "hypothes_is.md" >}})
    -   via pdf.js[^fn:2]
-   [Polar]({{< relref "polar.md" >}})

On Mobile:

-   Adobe Reader
-   Xodo


### E-Ink {#e-ink}

-   Kindle
    -   annotations on `My Clippings.txt`
-   Kobo
    -   annotations on `.kobo/KoboReader.sqlite`
        -   <https://github.com/karlicoss/kobuddy>
    -   Official Android App
-   Koreader - <https://github.com/koreader/koreader>
    -   alternative open source software for e-ink devices


### Video {#video}

-   A [commenter](https://hyp.is/Cchw9t4VEeqy8os_dr4Hug/beepb00p.xyz/annotating.html) on Hypothes.is suggested [Vialogues]({{< relref "vialogues.md" >}})

[^fn:1]: great viewer, horrible note-taker
[^fn:2]: reading books in browsers sounds like some kind of torture
